ThirdParty-v1912/swak4Foam-latest/Examples/tests/conditionalWriting/movingConeDistortedRandom/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    movingWall      
    {
        type            groovyBC;
        value           uniform (1 0 0);
        //        valueExpression "vector(toFace(pointMotionUx),0,0)";
        valueExpression "toFace(pointMotionU)";
    }

    farFieldMoving  
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    fixedWall       
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    axis            
    {
        type            symmetryPlane;
    }

    left            
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    farField        
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    back            
    {
        type            wedge;
    }

    front           
    {
        type            wedge;
    }
}

// ************************************************************************* //
